#+title: Prow Jobs
#+PROPERTY: header-args:sql-mode+ :product postgres

* Trying it out

You can start up the db by running in the shell, from the root of the repo:

#+begin_src sh
docker build -t infrasnoop .
docker-compose up
#+end_src

Then, in a new terminal window, run:
#+begin_src
cd go-client
go run main.go
#+end_src

Now that the two are up, we can load up the jobs from the prow deck.

#+begin_src sql-mode
select * from add_prow_deck_jobs();
#+end_src

Checking the go output you'll see it starts to load up all the job specs.

Once it stops, we can check out our prow.job_spec table

#+begin_src sql-mode
select count(*) from prow.job_spec;
#+end_src

#+RESULTS:
:  count
: -------
:   1354
: (1 row)
:

And start to run the queries requested.  Here is one counting kind jobs with a testgrid-tab annotation that are using a cluster (arbitrary and prolly useless query, but whatevs!)

#+begin_src sql-mode
select count(*)
  from prow.job_spec j
 where j.data->'metadata'->'labels'?'preset-dind-enabled'
   and j.data->'metadata'->'annotations'?'testgrid-alert-email'
   and data->'spec'->'cluster' is not null;
#+end_src

#+RESULTS:
:  count
: -------
:    294
: (1 row)

Or, if we wanted all the annotations for the first result of that, we could do.
#+begin_src sql-mode
with sample_job as (
  select *
    from prow.job_spec j
   where j.data->'metadata'->'labels'?'preset-dind-enabled'
     and j.data->'metadata'->'annotations'?'testgrid-alert-email'
     and data->'spec'->'cluster' is not null
   limit 1
)

select
  job,
  jsonb_object_keys(data->'metadata'->'annotations') as annotations,
       jsonb_object_keys(data->'metadata'->'labels') as labels
  from sample_job;
#+end_src

#+RESULTS:
#+begin_example
          job          |         annotations         |           labels
-----------------------+-----------------------------+-----------------------------
 capz-conformance-1-25 | prow.k8s.io/job             | prow.k8s.io/id
 capz-conformance-1-25 | testgrid-tab-name           | created-by-prow
 capz-conformance-1-25 | prow.k8s.io/context         | prow.k8s.io/job
 capz-conformance-1-25 | testgrid-dashboards         | prow.k8s.io/type
 capz-conformance-1-25 | testgrid-alert-email        | preset-dind-enabled
 capz-conformance-1-25 | testgrid-num-columns-recent | prow.k8s.io/context
 capz-conformance-1-25 |                             | prow.k8s.io/build-id
 capz-conformance-1-25 |                             | prow.k8s.io/refs.org
 capz-conformance-1-25 |                             | prow.k8s.io/refs.repo
 capz-conformance-1-25 |                             | preset-azure-cred-only
 capz-conformance-1-25 |                             | preset-kind-volume-mounts
 capz-conformance-1-25 |                             | prow.k8s.io/refs.base_ref
 capz-conformance-1-25 |                             | preset-azure-anonymous-pull
(13 rows)
#+end_example

